def conjugate(v, e):
    # https://namu.wiki/w/한국어/불규칙%20활용
    ## 1. 어간이 바뀌는 불규칙 활용
    # 1.1. ㄷ 불규칙 활용
    
    
    # 1.2. 르 불규칙 활용
    
    
    # 1.3. ㅂ 불규칙 활용
    
    
    # 1.4. ㅅ 불규칙 활용
    
    
    # 1.5. 우 불규칙 활용
    
    
    # 1.6. ㅡ 탈락 불규칙 활용
    
    
    ## 2. 어미가 바뀌는 불규칙 활용
    # 2.1. 거라 불규칙 활용
    
    
    # 2.2. 너라 불규칙 활용
    
    
    # 2.3. 러 불규칙 활용
    
    
    # 2.4. 여 불규칙 활용
    
    
    # 2.5. 오 불규칙 활용
    
    
    ## 3. 어간과 어미가 모두 바뀌는 불규칙 활용
    # 3.1. ㅎ 불규칙 활용
    
    
    # 4. 활용이 불완전한 동사
    
    
    ## 5. 헷갈리기 쉬운 불규칙 활용
    # 5.1. 이르다
    
    
    # 5.2. 붇다, 붓다, 불다
    
    
    ## 6. 체언    
    # 6.1. 복수형
    
    
    ## 7. 높임법
    # 7.1. 조사
    
    
    return (v, e)